src/InformationRegisters/кфкИсходящиеСообщения/кфкИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9bb60e0f-842a-4fa4-ac2b-edd89101fe4a">
  <name>кфкИсходящиеСообщения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="6b53242f-90ec-4441-929d-e40a10912da1">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="645be078-31fe-4466-b372-8bb9bfa3f5be">
    <name>ИсходныеДанные</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c8b56203-f691-4ecb-baa5-349014dc183d">
    <name>ЭтоУдаление</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="219a3ae5-d22d-467d-b06a-ac34b1cb0b28">
    <name>КлючСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="afab001f-7c73-48bc-8796-c31e7bf52af0">
    <name>Заголовки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="bb437059-733a-4568-833f-93a08c527b14">
    <name>ТелоСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="edf8a9c9-f606-41ee-a73e-b96b0e7cca2a">
    <name>Продюсер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="999a4a8e-9e06-4003-bef9-df9a1040dd3c">
    <name>ТипОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="292b6eec-1780-46e7-8559-9493aa1ddb42">
    <name>ТипИсходныхДанных</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7c42290-9fd9-47f2-aab1-06ebdfba17ce">
    <name>КлючОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="46012b4d-4b78-4cbd-8d0d-18101a391f7f">
    <name>СобытиеРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95dd5ec5-8b2e-459f-a936-2a5d2be7b2a4">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28f1a3aa-a8a0-404d-97be-3f9ebb177a1a">
    <name>ДатаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee05bfa3-5c0b-4ad6-962d-b2ec05fed003">
    <name>ДатаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e799e980-8ada-4039-a30c-da9f60bebb2d">
    <name>ДлОбработкиМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a856e5db-41c4-4e7d-981e-2c56dcb0b477">
    <name>ТекстЖурнала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d139c82-f66c-4620-a76a-8cb29ad47bce">
    <name>КоличествоОбработок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="285c25ea-c7ab-4ec5-b049-028ac1a7e72d">
    <name>КоличествоВыгрузок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="aa816974-7fec-4c4a-a209-74cbe7e41026">
    <name>МеткаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="bc51b526-bde0-4420-be0b-4163f25aa1ed">
    <name>КлючЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="dcea6dff-ee4d-4454-ab67-2dff64dc7131">
    <name>МеткаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкСтатусыСообщений/кфкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="90c87861-83c3-4174-81dd-550f291515d7">
  <name>кфкСтатусыСообщений</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e87ed46a-b4fe-41ad-a05b-c7d43a993d59">
    <name>Новое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4aa47c21-1293-47d6-b3ab-9d29a043b1dc">
    <name>Обработано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82907498-6643-4090-a81d-dd1982638a68">
    <name>ОбработкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bb65cb4f-750e-4084-b787-633ed9393166">
    <name>ОшибкаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="31aa5e8e-008e-4e64-bdea-a9307ad0bcc1">
    <name>Выгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2aad9bb4-aca4-411a-8268-a2c8d7a9efe8">
    <name>ОшибкаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b1566b75-70c6-497a-8ff6-bdaa91eddbbe">
    <name>ВыгрузкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/CommonModules/РС_кфкИсходящиеСообщения_ММ/Module.bsl
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ВТранзакции()
		.ДобавитьТестовыйНабор(
			"Регистр сведений кфкИсходящиеСообщения. Модуль менеджера. СброситьСтатусОшибки()")
			.Тег("Модульные")
			.Тег("кфкИсходящиеСообщения")
			.Тег("СброситьСтатусОшибки")
			.ДобавитьСерверныйТест("СброситьСтатусОшибки_ВосстанавливаетСтатусы",
				"СброситьСтатусОшибки(). Восстанавливает статусы обработки и выгрузки")
				.Тег("ВосстанавливаетСтатусы")
		.ДобавитьТестовыйНабор(
			"Регистр сведений кфкИсходящиеСообщения. Модуль менеджера. УдалитьСообщения()")
			.Тег("Модульные")
			.Тег("кфкИсходящиеСообщения")
			.Тег("УдалитьСообщения")
			.ДобавитьСерверныйТест("УдалитьСообщения_УдаляетПереданныеКлючи",
				"УдалитьСообщения(). Удаляет записи по массиву ключей")
				.Тег("УдаляетПереданныеКлючи")
			.ДобавитьСерверныйТест("УдалитьСообщения_УдаляетПоЗапросу",
				"УдалитьСообщения(). Удаляет записи по описанию запроса")
				.Тег("УдаляетПоЗапросу")
		.ДобавитьТестовыйНабор(
			"Регистр сведений кфкИсходящиеСообщения. Модуль менеджера. ОчиститьРегистр()")
			.Тег("Модульные")
			.Тег("кфкИсходящиеСообщения")
			.Тег("ОчиститьРегистр")
			.ДобавитьСерверныйТест("ОчиститьРегистр_УдаляетВсеСообщения",
				"ОчиститьРегистр(). Удаляет все записи")
				.Тег("УдаляетВсеСообщения");
	
КонецПроцедуры



Процедура СброситьСтатусОшибки_ВосстанавливаетСтатусы() Экспорт
	
	КлючОшибкиОбработки = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.ОшибкаОбработки);
	КлючОшибкиВыгрузки = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки);
	КлючНового = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	
	Ключи = Новый Массив;
	Ключи.Добавить(КлючОшибкиОбработки);
	Ключи.Добавить(КлючОшибкиВыгрузки);
	Ключи.Добавить(КлючНового);
	РегистрыСведений.кфкИсходящиеСообщения.СброситьСтатусОшибки(Ключи);
	
	ПроверитьСтатус(КлючОшибкиОбработки, Перечисления.кфкСтатусыСообщений.Новое);
	ПроверитьСтатус(КлючОшибкиВыгрузки, Перечисления.кфкСтатусыСообщений.Обработано);
	ПроверитьСтатус(КлючНового, Перечисления.кфкСтатусыСообщений.Новое);
	
КонецПроцедуры

Процедура УдалитьСообщения_УдаляетПереданныеКлючи() Экспорт
	
	КлючКУдалению = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	СохраняемыйКлюч = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	
	Ключи = Новый Массив;
	Ключи.Добавить(КлючКУдалению);
	РегистрыСведений.кфкИсходящиеСообщения.УдалитьСообщения(Ключи);
	
	ПроверитьОтсутствиеЗаписи(КлючКУдалению);
	ПроверитьСтатус(СохраняемыйКлюч, Перечисления.кфкСтатусыСообщений.Новое);
	
КонецПроцедуры

Процедура УдалитьСообщения_УдаляетПоЗапросу() Экспорт
	
	КлючКУдалению = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	СохраняемыйКлюч = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	
	ОписаниеЗапроса = Новый Структура;
	ОписаниеЗапроса.Вставить("Текст",
		"ВЫБРАТЬ
		|	Исходящие.КлючЗаписи,
		|	Исходящие.ДатаРегистрацииМС
		|ИЗ
		|	РегистрСведений.кфкИсходящиеСообщения КАК Исходящие
		|ГДЕ
		|	Исходящие.КлючЗаписи = &КлючЗаписи");
	ОписаниеЗапроса.Вставить("Параметры",
		Новый Структура("КлючЗаписи", КлючКУдалению.КлючЗаписи));
	
	РегистрыСведений.кфкИсходящиеСообщения.УдалитьСообщения(ОписаниеЗапроса);
	
	ПроверитьОтсутствиеЗаписи(КлючКУдалению);
	ПроверитьСтатус(СохраняемыйКлюч, Перечисления.кфкСтатусыСообщений.Новое);
	
КонецПроцедуры

Процедура ОчиститьРегистр_УдаляетВсеСообщения() Экспорт
	
	ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	
	РегистрыСведений.кфкИсходящиеСообщения.ОчиститьРегистр();
	
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкИсходящиеСообщения")
		.НеСодержитЗаписи();
	
КонецПроцедуры

Функция ДобавитьСообщение(Статус)
	
	КлючЗаписи = "yaxunit-" + Строка(Новый УникальныйИдентификатор);
	ДатаРегистрацииМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запись = РегистрыСведений.кфкИсходящиеСообщения.СоздатьМенеджерЗаписи();
	Запись.КлючЗаписи = КлючЗаписи;
	Запись.ДатаРегистрацииМС = ДатаРегистрацииМС;
	Запись.Статус = Статус;
	Запись.Записать();
	
	ЗначенияКлюча = Новый Структура("КлючЗаписи,ДатаРегистрацииМС", КлючЗаписи, ДатаРегистрацииМС);
	Возврат РегистрыСведений.кфкИсходящиеСообщения.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции

Процедура ПроверитьСтатус(Ключ, ОжидаемыйСтатус)
	
	Предикат = ЮТест.Предикат()
		.Реквизит("КлючЗаписи").Равно(Ключ.КлючЗаписи)
		.Реквизит("ДатаРегистрацииМС").Равно(Ключ.ДатаРегистрацииМС)
		.Реквизит("Статус").Равно(ОжидаемыйСтатус);
	
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкИсходящиеСообщения")
		.СодержитЗаписи(Предикат);
	
КонецПроцедуры

Процедура ПроверитьОтсутствиеЗаписи(Ключ)
	
	Предикат = ЮТест.Предикат()
		.Реквизит("КлючЗаписи").Равно(Ключ.КлючЗаписи)
		.Реквизит("ДатаРегистрацииМС").Равно(Ключ.ДатаРегистрацииМС);
	
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкИсходящиеСообщения")
		.НеСодержитЗаписи(Предикат);
	
КонецПроцедуры
